In [1]:
# Dependencies
import pandas as pd

In [2]:
# Name of the CSV file
file = 'Resources/donors2008.csv'

In [3]:
# The correct encoding must be used to read the CSV in pandas
df = pd.read_csv(file, encoding="ISO-8859-1")

In [7]:
# Preview of the DataFrame
# Note that FIELD8 is likely a meaningless column
df.head()
#Deleted in the next step, then came back and ran - proves it's gone - only gone in here, not saved to the csv file

  LastName FirstName          Employer      City State    Zip  Amount
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0
3    Adams  Lorraine              Self  New York    NY  10026   200.0
4    Adams    Marion              None    Exeter    NH  03833   100.0

In [6]:
# Delete extraneous column
del df['FIELD8']
df.head()

  LastName FirstName          Employer      City State    Zip  Amount
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0
3    Adams  Lorraine              Self  New York    NY  10026   200.0
4    Adams    Marion              None    Exeter    NH  03833   100.0

In [8]:
# Identify incomplete rows
df.count()

LastName     1776
FirstName    1776
Employer     1743
City         1776
State        1776
Zip          1776
Amount       1776
dtype: int64

In [9]:
df

,LastName,FirstName,Employer,City,State,Zip,Amount
0,Aaron,Eugene,State Department,Dulles,VA,20189,500.0
1,Abadi,Barbara,Abadi & Co.,New York,NY,10021,200.0
2,Adamany,Anthony,Retired,Rockford,IL,61103,500.0
3,Adams,Lorraine,Self,New York,NY,10026,200.0
4,Adams,Marion,None,Exeter,NH,03833,100.0
...,...,...,...,...,...,...,...
1771,Zinczenko,David,Rodale,Allentown,PA,18102,500.0
1772,Zschiesche,Peter,NaN,San Diego,CA,92104,250.0
1773,Zweidinger,Ruth,NaN,Hillsborough,NC,27278,250.0
1774,Zwerdling,David,"Montg Cnty, Md",Silver Spring,MD,20910,35.0
1775,Zyskind,Jon,JDS Uniphase,Concord,MA,10742,25.0

In [10]:
# Drop all rows with missing information
cleaned_df = df.dropna(how='any')
#this drops any row with a NaN value

In [11]:
# Verify dropped rows
cleaned_df.count()

LastName     1743
FirstName    1743
Employer     1743
City         1743
State        1743
Zip          1743
Amount       1743
dtype: int64

In [13]:
# The Amount column is the wrong data type. It should be numeric.
cleaned_df.dtypes

LastName      object
FirstName     object
Employer      object
City          object
State         object
Zip           object
Amount       float64
dtype: object

In [14]:
# Use pd.to_numeric() method to convert the datatype of the Amount column
cleaned_df['Amount'] = pd.to_numeric(cleaned_df['Amount'])
#The red below is a warning, not an error

<ipython-input-14-79670bea2618>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_df['Amount'] = pd.to_numeric(cleaned_df['Amount'])

In [15]:
# Verify that the Amount column datatype has been made numeric
cleaned_df['Amount'].dtype

dtype('float64')

In [16]:
# Display an overview of the Employers column
cleaned_df['Employer'].value_counts()

None                             249
Self                             241
Retired                          126
Self Employed                     39
Self-Employed                     34
                                ...
The Penta Building Group           1
Fairfax County Public Schools      1
Commonwealth Of Pennsylvania       1
Related Companies                  1
Draughn & Associates               1
Name: Employer, Length: 1011, dtype: int64

In [19]:
# Clean up Employer category. Replace 'Self Employed' and 'Self' with 'Self-Employed'
cleaned_df['Employer'] = cleaned_df['Employer'].replace(
    {'Self Employed': 'Self-Employed', 'Self': 'Self-Employed'})
cleaned_df['Employer'] = cleaned_df['Employer'].replace(
    {'None': 'Unemployed', 'Not Employed': 'Unemployed'})
#Replacing this with a dictionary - all will be set to Self-Employed

<ipython-input-19-5214379aad38>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_df['Employer'] = cleaned_df['Employer'].replace(
<ipython-input-19-5214379aad38>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cleaned_df['Employer'] = cleaned_df['Employer'].replace(

In [20]:
# Verify clean-up.
cleaned_df['Employer'].value_counts()

Self-Employed                     314
Unemployed                        257
Retired                           126
Google                              6
Social Security Administration      3
                                 ...
Help/Systems                        1
Annie Casey Foundation              1
The Penta Building Group            1
Fairfax County Public Schools       1
Draughn & Associates                1
Name: Employer, Length: 1007, dtype: int64

In [22]:
# Display a statistical overview
# We can infer the maximum allowable individual contribution from 'max'
cleaned_df.describe()

            Amount
count  1743.000000
mean    640.124750
std    1242.343265
min       5.000000
25%     200.000000
50%     250.000000
75%     500.000000
max    5000.000000